chore: update ASCII diagram to mermaid
